import { Question } from './types';

export const QUESTIONS: Question[] = [
  // PART 1
  { id: 1, part: 1, text: "今年，你做了哪些之前从没做过的事？" },
  { id: 2, part: 1, text: "坚持年初和自己许下的约定了吗？" },
  { id: 3, part: 1, text: "身边有人生孩子了吗？" },
  { id: 4, part: 1, text: "身边有人去世了吗？" },
  { id: 5, part: 1, text: "去了哪些城市 / 州 / 国家？" },
  { id: 6, part: 1, text: "明年你想要拥有哪些今年没有的东西？" },
  { id: 7, part: 1, text: "今年的哪个或哪些日子会铭刻在你的记忆中，为什么？" },
  { id: 8, part: 1, text: "你今年最大的成就是什么？" },
  { id: 9, part: 1, text: "你今年最大的失败是什么？" },
  { id: 10, part: 1, text: "你今年还遇到过哪些困难？" },
  
  // PART 2
  { id: 11, part: 2, text: "你今年是否生过病或受过伤？" },
  { id: 12, part: 2, text: "你今年买过的最好的东西是什么？" },
  { id: 13, part: 2, text: "谁的行为值得去表扬？" },
  { id: 14, part: 2, text: "谁的行为令你感到震惊？" },
  { id: 15, part: 2, text: "你大部分的钱都花到哪里去了？" },
  { id: 16, part: 2, text: "有什么事让你感到超级、超级、超级兴奋？" },
  { id: 17, part: 2, text: "哪首歌会永远让你想起这一年？" },
  { id: 18, part: 2, text: "与去年这个时候相比，你是：感到更快乐还是更悲伤了？变得更瘦还是更胖了？变得更富还是更穷了？" },
  { id: 19, part: 2, text: "你希望自己能做得更多的是什么？" },
  { id: 20, part: 2, text: "你希望自己能做得更少的是什么？" },

  // PART 3
  { id: 21, part: 3, text: "你是如何度过节假日的？" },
  { id: 22, part: 3, text: "你今年坠入爱河了吗？" },
  { id: 23, part: 3, text: "是否有着过讨厌某个你去年此时不觉得讨厌的人呢？" },
  { id: 24, part: 3, text: "你最喜欢的电视节目是什么？" },
  { id: 25, part: 3, text: "你读过最好的一本书是什么？" },
  { id: 26, part: 3, text: "你今年发现的最好听的一首歌是什么？" },
  { id: 27, part: 3, text: "你今年看过最喜欢的电影是什么？" },
  { id: 28, part: 3, text: "你今年吃过最好吃的一顿饭是什么？" },
  { id: 29, part: 3, text: "有什么是你想要且得到了的？" },
  { id: 30, part: 3, text: "有什么是你想要却没有得到的？" },

  // PART 4
  { id: 31, part: 4, text: "你生日那天做了什么？" },
  { id: 32, part: 4, text: "有什么还未发生的事，如果发生了，会让你的这一年变得无比满足？" },
  { id: 33, part: 4, text: "你会如何描述你今年的个人时尚风格？" },
  { id: 34, part: 4, text: "是什么让你保持理智？" },
  { id: 35, part: 4, text: "你最赏识哪个名人 / 公众人物？" },
  { id: 36, part: 4, text: "哪个政治问题最令你有感而发？" },
  { id: 37, part: 4, text: "你想念哪些人？" },
  { id: 38, part: 4, text: "在你新认识的人之中，谁是最好的？" },
  { id: 39, part: 4, text: "今年你学到了什么宝贵的人生经验？" },
  { id: 40, part: 4, text: "能够总结你这一年的一句话是什么？" },
];